app/views/movies/_form.html.erb

SELECT "tags".* FROM "tags"
---
        <%= f.label :tags_ids,  "Tags"  %><br>
        <%= collection_check_boxes(:movie,  :tags_ids,
        Tag.all,  :id,  :name)  %>