app/views/movies/index.html.erb

    <ul>
    <%  movie.tags.each do |tag| %>
---
SELECT "tags".* FROM "tags" INNER JOIN "movies_tags" ON "tags"."id" = "movies_tags"."tag_id" WHERE "movies_tags"."movie_id" = $1  [["movie_id", 1]]