app/controllers/movies_controller.rb

  def create


   @movie = Movie.new(movie_params)
    tags_ids = movie_params[:tags_ids].delete_if { |x| x.empty?}
    @tags = Tag.find(tags_ids)
    @movie.tags << @tags
---
SELECT  "tags".* FROM "tags" WHERE "tags"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "movies" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Harry Potter"], ["created_at", 2016-11-24 02:53:58 UTC], ["updated_at", 2016-11-24 02:53:58 UTC]]

  def update
    respond_to do |format|


   tags_ids = movie_params[:tags_ids].delete_if { |x| x.empty?}
    @tags = Tag.find(tags_ids)
---
SELECT  "tags".* FROM "tags" WHERE "tags"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

def delete_tag
 @movie = Movie.find(params[:id])
 tag = Tag.find(params[:tag_id])
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "tags".* FROM "tags" WHERE "tags"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]